In [1]:
import pandas as pd
import numpy as np

In [2]:
df_event = pd.read_csv("Interaction_Data.csv")
df_event.head()

       timestamp  visitorid event  itemid  transactionid  rating
0  1433221332117     257597  view  355908            NaN       1
1  1433224214164     992329  view  248676            NaN       1
2  1433221999827     111016  view  318965            NaN       1
3  1433221955914     483717  view  253185            NaN       1
4  1433221337106     951259  view  367447            NaN       1

In [3]:
df_demog = pd.read_csv("Demography_Data.csv")
df_demog.head()

    Usia                Gender    Lokasi Tinggal
0  25-34  Tidak Ingin Menjawab          Bengkulu
1  25-34             Perempuan       Papua Barat
2  18-24           Laki - laki         Gorontalo
3  25-34  Tidak Ingin Menjawab    Sulawesi Utara
4    >45           Laki - laki  Kalimantan Barat

In [4]:
df_cat = pd.read_csv("Category_Data.csv")
df_cat.head()

                 category
0              Elektronik
1                 Fashion
2                    Buku
3            Rumah Tangga
4  Kesehatan & Kecantikan

In [5]:
unique_visitors = df_event['visitorid'].unique()

assigned_rows = []

for vid in unique_visitors:
    np.random.seed(hash(vid) % (2**32))
    
    rand_idx = np.random.choice(df_demog.index)
    
    assigned_rows.append(df_demog.loc[rand_idx])

df_user_map = pd.DataFrame({'visitorid': unique_visitors}).reset_index(drop=True)
df_user_map = pd.concat([df_user_map, pd.DataFrame(assigned_rows).reset_index(drop=True)], axis=1)

df_user_map.head()

   visitorid   Usia                Gender       Lokasi Tinggal
0     257597  25-34  Tidak Ingin Menjawab                 Bali
1     992329  35-44  Tidak Ingin Menjawab          Papua Barat
2     111016    <18           Laki - laki      Sulawesi Tengah
3     483717  25-34             Perempuan    Kalimantan Tengah
4     951259    <18             Perempuan  Nusa Tenggara Timur

In [6]:
unique_items = df_event['itemid'].unique()

assigned_categories = []

for iid in unique_items:
    np.random.seed(hash(iid) % (2**32))
    
    rand_idx = np.random.choice(df_cat.index)
    
    assigned_categories.append(df_cat.loc[rand_idx,'category'])
    
df_item_map = pd.DataFrame({
    'itemid': unique_items,
    'category': assigned_categories
})

df_item_map.head(10)

   itemid                category
0  355908                 Fashion
1  248676                Otomotif
2  318965  Kesehatan & Kecantikan
3  253185                 Fashion
4  367447  Kesehatan & Kecantikan
5   22556            Rumah Tangga
6  443030           Mainan & Hobi
7  439202              Elektronik
8  428805                Otomotif
9   82389            Rumah Tangga

In [7]:
df_merged = pd.merge(df_event, df_user_map, on='visitorid', how='left')

df_final = pd.merge(df_merged, df_item_map, on='itemid', how='left')

df_final.head(10)

,timestamp,visitorid,event,itemid,transactionid,rating,Usia,Gender,Lokasi Tinggal,category
0,1433221332117,257597,view,355908,NaN,1,25-34,Tidak Ingin Menjawab,Bali,Fashion
1,1433224214164,992329,view,248676,NaN,1,35-44,Tidak Ingin Menjawab,Papua Barat,Otomotif
2,1433221999827,111016,view,318965,NaN,1,<18,Laki - laki,Sulawesi Tengah,Kesehatan & Kecantikan
3,1433221955914,483717,view,253185,NaN,1,25-34,Perempuan,Kalimantan Tengah,Fashion
4,1433221337106,951259,view,367447,NaN,1,<18,Perempuan,Nusa Tenggara Timur,Kesehatan & Kecantikan
5,1433224086234,972639,view,22556,NaN,1,18-24,Tidak Ingin Menjawab,Riau,Rumah Tangga
6,1433221923240,810725,view,443030,NaN,1,<18,Tidak Ingin Menjawab,Bengkulu,Mainan & Hobi
7,1433223291897,794181,view,439202,NaN,1,18-24,Tidak Ingin Menjawab,Riau,Elektronik
8,1433220899221,824915,view,428805,NaN,1,25-34,Tidak Ingin Menjawab,Sulawesi Selatan,Otomotif
9,1433221204592,339335,view,82389,NaN,1,35-44,Laki - laki,Bangka Belitung,Rumah Tangga

In [8]:
df_final.to_csv('Final_Data.csv', index=False)